zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_lp.h
#if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CALIBRATION_EN) || \
     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CALIBRATION_EN) || \
     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_CALIBRATION_EN) || \
     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_CALIBRATION_EN))

#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CDAC_REF_AUTO_EN)
    cy_capsense_status_t Cy_CapSense_CalibrateRefCdac(
                    uint32_t widgetId,
                    cy_stc_capsense_context_t * context);
#endif
#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CDAC_COMP_DIV_AUTO_EN)
    cy_capsense_status_t Cy_CapSense_CalibrateCompDivider(
                    uint32_t widgetId,
                    cy_stc_capsense_context_t * context);
#endif
#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CDAC_COMP_AUTO_EN)
    cy_capsense_status_t Cy_CapSense_CalibrateCompCdac(
                    uint32_t widgetId,
                    cy_stc_capsense_context_t * context);
#endif
cy_capsense_status_t Cy_CapSense_VerifyCalibration(
                uint32_t widgetId,
                cy_stc_capsense_context_t * context);
#endif
#if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CDAC_COMP_AUTO_EN) && \
     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_CALIBRATION_EN))
    cy_capsense_status_t Cy_CapSense_CalibrateCompCdacWbx(
                    uint32_t widgetId,
                    cy_stc_capsense_context_t * context);
#endif

#if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CALIBRATION_EN) || \
     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CALIBRATION_EN) || \
     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_CALIBRATION_EN) || \
     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_CALIBRATION_EN))
#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CDAC_FINE_AUTO_EN)
    cy_capsense_status_t Cy_CapSense_CalibrateFineCdac(
                    uint32_t widgetId,
                    cy_stc_capsense_context_t * context);
#endif
cy_capsense_status_t Cy_CapSense_CalibrateAllWidgets_V3Lp(
                cy_stc_capsense_context_t * context);
cy_capsense_status_t Cy_CapSense_CalibrateAllSlots_V3Lp(
                cy_stc_capsense_context_t * context);
cy_capsense_status_t Cy_CapSense_SetCalibrationTarget_V3Lp(
                uint32_t calibrTarget,
                uint32_t snsMethod,
                cy_stc_capsense_context_t * context);
cy_capsense_status_t Cy_CapSense_CalibrateWidget_V3Lp(
                uint32_t widgetId,
                cy_stc_capsense_context_t * context);
#endif
cy_capsense_status_t Cy_CapSense_WaitEndScan(
                uint32_t timeout,
                cy_stc_capsense_context_t * context);
void Cy_CapSense_SetShieldPinsInDesiredState(
                uint32_t desiredDriveMode,
                en_hsiom_sel_t desiredHsiom,
                uint32_t desiredMscCtrl,
                const cy_stc_capsense_context_t * context);
cy_capsense_status_t Cy_CapSense_SwitchHwConfiguration(
                uint32_t configuration,
                cy_stc_capsense_context_t * context);
uint32_t Cy_CapSense_GetLfsrDitherVal(
                uint32_t lfsrBits,
                uint32_t lfsrScale);
uint32_t Cy_CapSense_GetLfsrDitherLimit(
                uint32_t snsClkDivider,
                uint32_t snsClkDividerMin,
                uint32_t ditherLimitPercents,
                uint32_t lfsrScale);
cy_capsense_status_t Cy_CapSense_InitializeSourceSenseClk(
                const cy_stc_capsense_context_t * context);

#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_SMARTSENSE_EN)
    cy_capsense_status_t Cy_CapSense_SsAutoTune(
                    cy_stc_capsense_context_t * context);
    cy_capsense_status_t Cy_CapSense_IsSmarSenseWidgetValid(
                    const cy_stc_capsense_widget_config_t * ptrWdConfig);
    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CIC2_FILTER_EN)
        uint32_t Cy_CapSense_SsSquareRoot16(uint16_t value);
    #endif
#endif

cy_capsense_mw_state_t Cy_CapSense_MwState_V3Lp(
                const cy_stc_capsense_context_t * context);
cy_capsense_status_t Cy_CapSense_ScanAbort_V3Lp(
                cy_stc_capsense_context_t * context);

#if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CIC2_FILTER_EN)
    uint32_t Cy_CapSense_GetCIC2SamplesMax(uint32_t cic2Rate);
    uint32_t Cy_CapSense_GetCIC2HwDivider(uint32_t cic2Samples);
    uint32_t Cy_CapSense_GetCIC2HwShift(uint32_t cic2Samples);
    #if (CY_CAPSENSE_CIC2_FILTER_AUTO_EN)
        cy_capsense_status_t Cy_CapSense_InitializeCic2Shift(
                        cy_stc_capsense_context_t * context);
    #endif
    #if (CY_CAPSENSE_CIC_RATE_MODE_AUTO_EN)
        cy_capsense_status_t Cy_CapSense_InitializeCic2Rate(
                        cy_stc_capsense_context_t * context);
    #endif
#endif /* #if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CIC2_FILTER_EN) */

void Cy_CapSense_SetupCpuOperatingMode(cy_stc_capsense_context_t * context);
void Cy_CapSense_StartCpuScan(const uint32_t * scanConfig, cy_stc_capsense_context_t * context);
uint32_t Cy_CapSense_WaitEndOfCpuScan(uint32_t watchdogTime, cy_stc_capsense_context_t * context);
cy_capsense_status_t Cy_CapSense_ExecuteSaturatedScan(
                uint32_t * ptrMaxRaw,
                uint32_t widgetId,
                uint32_t scanSlotId,
                uint32_t mode,
                cy_stc_capsense_context_t * context);
void Cy_CapSense_ConfigureSaturationMode(
                cy_stc_capsense_context_t * context);
uint32_t Cy_CapSense_GetScanWatchdogTime(
                uint32_t widgetId,
                uint32_t scanSlotId,
                cy_stc_capsense_context_t * context);

/** \} \endcond */


/*******************************************************************************
* Local definition
*******************************************************************************/
#define CY_CAPSENSE_MSCLP_INTR_ALL_MSK                          (MSCLP_INTR_MASK_SUB_SAMPLE_Msk |\
                                                                 MSCLP_INTR_MASK_SAMPLE_Msk |\
                                                                 MSCLP_INTR_MASK_SCAN_Msk |\
                                                                 MSCLP_INTR_MASK_INIT_Msk |\
                                                                 MSCLP_INTR_MASK_FRAME_Msk |\
                                                                 MSCLP_INTR_MASK_CONFIG_REQ_Msk |\
                                                                 MSCLP_INTR_MASK_FIFO_UNDERFLOW_Msk |\
                                                                 MSCLP_INTR_MASK_FIFO_OVERFLOW_Msk)

#define CY_CAPSENSE_MSCLP_INTR_LP_ALL_MSK                       (MSCLP_INTR_LP_SIG_DET_Msk |\
                                                                 MSCLP_INTR_LP_FR_TIMEOUT_Msk |\
                                                                 MSCLP_INTR_LP_FRAME_Msk |\
                                                                 MSCLP_INTR_LP_CE_DONE_Msk |\
                                                                 MSCLP_INTR_LP_IMO_UP_Msk)

#define CY_CAPSENSE_CDAC_MAX_CODE                               (0xFFu)
#define CY_CAPSENSE_CAL_REF_CDAC_MIN_CODE                       (0x7u)
#define CY_CAPSENSE_REF_CDAC_LSB_X100                           (887u)
#define CY_CAPSENSE_MULTIPLIER_TWO                              (2u)

