zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_lp.h
#define CY_CAPSENSE_CAL_REF_CDAC_MIDDLE_CODE                    (0x80u)
#define CY_CAPSENSE_CAL_FINE_CDAC_MIDDLE_CODE                   (0x10u)
#define CY_CAPSENSE_CAL_COMP_CDAC_MIDDLE_CODE                   (0x80u)

#define CY_CAPSENSE_CAL_FINE_CDAC_Msk                           (0x1FUL)
#define CY_CAPSENSE_CAL_CDAC_Msk                                (0x1FE0UL)
#define CY_CAPSENSE_CAL_CDAC_Pos                                (5u)

#define CY_CAPSENSE_CAL_MIDDLE_VALUE                            (0x1000u)
#define CY_CAPSENSE_CAL_NUM_SCANS_VALUE                         (8u)
#define CY_CAPSENSE_CAL_FINE_NUM_SCANS_VALUE                    (13u)

#define CY_CAPSENSE_CAL_MODE_REF_CDAC_SUC_APPR                  (0u)
#define CY_CAPSENSE_CAL_MODE_COMP_CDAC_SUC_APPR                 (2u)

#define CY_CAPSENSE_CAL_MODE_COMP_CDAC_CODE_MIN                 (0u)
#define CY_CAPSENSE_CAL_MODE_COMP_CDAC_CODE_MAX                 (1u)
#define CY_CAPSENSE_CAL_MODE_COMP_CDAC_CODE_VAL                 (2u)

#define CY_CAPSENSE_MRSS_TURN_ON                                (0u)
#define CY_CAPSENSE_MRSS_TURN_OFF                               (1u)
#define CY_CAPSENSE_MRSS_IMO_TURN_ON                            (2u)
#define CY_CAPSENSE_MRSS_IMO_TURN_OFF                           (3u)

#define CY_CAPSENSE_LFSR_RANGE_0_DITHER_MAX                     (2u)
#define CY_CAPSENSE_LFSR_RANGE_1_DITHER_MAX                     (4u)
#define CY_CAPSENSE_LFSR_RANGE_2_DITHER_MAX                     (8u)
#define CY_CAPSENSE_LFSR_RANGE_3_DITHER_MAX                     (16u)

#define CY_CAPSENSE_2PH_PRS_SNS_CLOCK_DIVIDER_SHIFT             (1u)
#define CY_CAPSENSE_4PH_PRS_SNS_CLOCK_DIVIDER_SHIFT             (2u)

#define CY_CAPSENSE_DIRECT_SNS_CLOCK_DIVIDER_MAX                (4096u)
#define CY_CAPSENSE_2PH_DIRECT_SNS_CLOCK_DIVIDER_MIN            (4u)
#define CY_CAPSENSE_4PH_DIRECT_SNS_CLOCK_DIVIDER_MIN            (8u)

#define CY_CAPSENSE_SMARTSENSE_WD_MAX_NUMBER                    (64u)

#define CY_CAPSENSE_SMARTSENSE_CSD_PRELIMINARY_SCAN_NSUB        (64u)
#define CY_CAPSENSE_SMARTSENSE_CSD_PRELIMINARY_SCAN_SNS_CLK     (256u)
#define CY_CAPSENSE_SMARTSENSE_CSD_PRELIMINARY_SCAN_REF_CDAC    (100u)

#define CY_CAPSENSE_SMARTSENSE_ISX_PRELIMINARY_SCAN_NSUB        (185u)
#define CY_CAPSENSE_SMARTSENSE_ISX_PRELIMINARY_SCAN_SNS_CLK     (200u)
#define CY_CAPSENSE_SMARTSENSE_ISX_PRELIMINARY_SCAN_REF_CDAC    (255u)
#define CY_CAPSENSE_SMARTSENSE_ISX_SNS_CLK_MIN                  (8u)
#define CY_CAPSENSE_SMARTSENSE_ISX_SNS_CLK_STEP                 (4u)
#define CY_CAPSENSE_SMARTSENSE_ISX_PRELIMINARY_SCAN_STOP        (95u)

#define CY_CAPSENSE_MAX_EPI_KREF_DELAY_PRS_NUMBER               (255u)
#define CY_CAPSENSE_MAX_PRO_WAIT_KREF_DELAY_PRS_NUMBER          (31u)

#define CY_CAPSENSE_CALIBRATION_REF_CDAC_MASK                   (0x01u)
#define CY_CAPSENSE_CALIBRATION_COMP_DIV_MASK                   (0x02u)
#define CY_CAPSENSE_CALIBRATION_COMP_CDAC_MASK                  (0x04u)

#define CY_CAPSENSE_SLOT_COUNT_MAX_VALUE                        (0xFFFFu)

#define CY_CAPSENSE_RC_HW_IIR_FILTER_COEFF_POS                  (24u)
#define CY_CAPSENSE_RC_HW_IIR_FILTER_COEFF_MASK                 (0x0F000000u)
#define CY_CAPSENSE_FRC_HW_IIR_FILTER_MASK                      (0x00FFFFFFu)

/* Max number of Low Power sensor historical raw counts to be stored in IP RAM */
#define CY_CAPSENSE_FIFO_SNS_RAW_HISTORY_NUM                    (21uL)
/* Max number of Low Power sensors */
#define CY_CAPSENSE_FIFO_SNS_LP_MAX_NUM                         (8u)
/* Max number of Active sensor configurations to be stored in IP RAM */
#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_RC_HW_IIR_FILTER_EN)
    #define CY_CAPSENSE_FIFO_SNS_MAX_NUM                            (MSCLP_SNS_SRAM_WORD_SIZE / (CY_MSCLP_11_SNS_REGS + 1u))
#else
    #define CY_CAPSENSE_FIFO_SNS_MAX_NUM                            (MSCLP_SNS_SRAM_WORD_SIZE / (CY_MSCLP_6_SNS_REGS + 1u))
#endif/* The wakeup timer maximum value for ACTIVE scan mode in milliseconds */
#define CY_CAPSENSE_MAX_WAKEUP_TIMER_MS                         (2000u)

/* CAPSENSE ILO compensation constants */
#define CY_CAPSENSE_1M_DIVIDER                                  (1000000uL)
#define CY_CAPSENSE_ILO_COMPENSATE_SHIFT                        (14u)

/* The default compensation factor for nominal ILO frequency (40KHz) */
#define CY_CAPSENSE_DEFAULT_ILO_FACTOR                          ((CY_SYSCLK_ILO_FREQ << CY_CAPSENSE_ILO_COMPENSATE_SHIFT) /\
                                                                 CY_CAPSENSE_1M_DIVIDER)

/*******************************************************************************
* HSIOM and PC Macros redefinition platform dependent and for readability
*******************************************************************************/
#define CY_CAPSENSE_HSIOM_SEL_GPIO                          (HSIOM_SEL_GPIO)
#define CY_CAPSENSE_HSIOM_SEL_CSD_SHIELD                    (HSIOM_SEL_CSD_SHIELD)
#define CY_CAPSENSE_HSIOM_SEL_CSD_SENSE                     (HSIOM_SEL_CSD_SENSE)
#define CY_CAPSENSE_HSIOM_SEL_AMUXA                         (HSIOM_SEL_AMUXA)
#define CY_CAPSENSE_HSIOM_SEL_AMUXB                         (HSIOM_SEL_AMUXB)
#define CY_CAPSENSE_DM_GPIO_ANALOG                          (CY_GPIO_DM_ANALOG)
#define CY_CAPSENSE_DM_GPIO_STRONG_IN_OFF                   (CY_GPIO_DM_STRONG_IN_OFF)


#if (CY_CAPSENSE_DISABLE == CY_CAPSENSE_USE_CAPTURE)

/*******************************************************************************
* Constant definition
*******************************************************************************/
/*
 *  Definition of the default configuration of the MSCLP HW registers that is
 *  intended to be used on the MSCLP HW block capturing stage.
 *  The configuration includes:
 *  1. Start of the analog settling process:
 *      - Enables the MSCLP HW block;
 *      - Enables all the sub-blocks of the MSCLP HW block;
 *      - Enables the Sense Modulator output;
 *  2. Clear all of the pending interrupt requests of the MSCLP HW block;
 *  3. Sets into default state the rest of the MSCLP HW block registers which are not related
 *     to actions #1 and #2.
*/

    #define CY_CAPSENSE_MSC_CONFIG_DEFAULT                  \
    {                                                       \
        .ctl                = MSCLP_CTL_SENSE_EN_Msk |      \
                              MSCLP_CTL_MSCCMP_EN_Msk |     \
                              MSCLP_CTL_ENABLED_Msk,        \
        .scanCtl1           = 0x00uL,                       \
        .scanCtl2           = 0x00uL,                       \
        .initCtl1           = 0x00uL,                       \
        .initCtl2           = 0x00uL,                       \
        .initCtl3           = 0x00uL,                       \
        .initCtl4           = 0x00uL,                       \
        .senseDutyCtl       = 0x00uL,                       \
        .sensePeriodCtl     = 0x00uL,                       \
        .filterCtl          = 0x00uL,                       \
        .ccompCdacCtl       = 0x00uL,                       \
        .ditherCdacCtl      = 0x00uL,                       \
        .mscCmpCtl          = 0x00uL,                       \
        .obsCtl             = 0x00uL,                       \
        .aosCtl             = 0x00uL,                       \
        .ceCtl              = 0x00uL,                       \
        .pumpCtl            = 0x00uL,                       \
        .imoCtl             = 0x00uL,                       \
        .intr               = 0x00uL,                       \
        .intrSet            = 0x00uL,                       \
        .intrMask           = 0x00uL,                       \
        .intrLp             = 0x00uL,                       \
        .intrLpSet          = 0x00uL,                       \
        .intrLpMask         = 0x00uL,                       \
        .swSelCdacRe        = 0x00uL,                       \
        .swSelCdacCo        = 0x00uL,                       \
        .swSelCdacCf        = 0x00uL,                       \
        .swSelBgr           = 0x00uL,                       \
        .swSelCswFunc[0u]   = 0x00uL,                       \
        .swSelCswFunc[1u]   = 0x00uL,                       \
        .swSelCswFunc[2u]   = 0x00uL,                       \
        .swSelCswFunc[3u]   = 0x00uL,                       \
        .swSelCswFunc[4u]   = 0x00uL,                       \
        .swSelCswFunc[5u]   = 0x00uL,                       \
        .swSelCswFunc[6u]   = 0x00uL,                       \
        .swSelCswFunc[7u]   = 0x00uL,                       \
        .mode[0u] =                                         \
        {                                                   \
            .senseDutyCtl   = 0x00uL,                       \
            .swSelCdacFl    = 0x00uL,                       \
            .swSelTop       = 0x00uL,                       \
            .swSelComp      = 0x00uL,                       \
            .swSelSh        = 0x00uL,                       \
            .swSelCmod1     = 0x00uL,                       \
            .swSelCmod2     = 0x00uL,                       \
        },                                                  \
        .mode[1u] =                                         \
        {                                                   \
            .senseDutyCtl   = 0x00uL,                       \
            .swSelCdacFl    = 0x00uL,                       \
            .swSelTop       = 0x00uL,                       \
            .swSelComp      = 0x00uL,                       \
            .swSelSh        = 0x00uL,                       \
            .swSelCmod1     = 0x00uL,                       \
            .swSelCmod2     = 0x00uL,                       \
        },                                                  \
        .mode[2u] =                                         \
        {                                                   \
            .senseDutyCtl   = 0x00uL,                       \
            .swSelCdacFl    = 0x00uL,                       \
            .swSelTop       = 0x00uL,                       \
            .swSelComp      = 0x00uL,                       \
            .swSelSh        = 0x00uL,                       \
            .swSelCmod1     = 0x00uL,                       \
            .swSelCmod2     = 0x00uL,                       \
        },                                                  \
        .mode[3u] =                                         \
        {                                                   \
            .senseDutyCtl   = 0x00uL,                       \
            .swSelCdacFl    = 0x00uL,                       \
            .swSelTop       = 0x00uL,                       \
            .swSelComp      = 0x00uL,                       \
            .swSelSh        = 0x00uL,                       \
            .swSelCmod1     = 0x00uL,                       \
            .swSelCmod2     = 0x00uL,                       \
        },                                                  \
    }

