zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_lp.h
    extern const cy_stc_msclp_base_config_t cy_capsense_msclpCfg;
#endif

#define CY_CAPSENSE_CSD_CDAC_COMP_USAGE             ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN) &&\
                                                     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CDAC_COMP_EN))
#define CY_CAPSENSE_CSD_CDAC_COMP_AUTO_USAGE        ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN) &&\
                                                     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CALIBRATION_EN) &&\
                                                     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CDAC_COMP_EN))
#define CY_CAPSENSE_CSD_CDAC_COMP_DIV_AUTO_USAGE    (CY_CAPSENSE_CSD_CDAC_COMP_USAGE &&\
                                                     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CALIBRATION_EN) &&\
                                                     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CDAC_COMP_DIV_AUTO_EN))
#define CY_CAPSENSE_CSD_CDAC_CALIBRATION_USAGE      ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN) &&\
                                                     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CALIBRATION_EN))
#define CY_CAPSENSE_CSD_CDAC_REF_AUTO_USAGE         ((CY_CAPSENSE_CSD_CDAC_CALIBRATION_USAGE) &&\
                                                     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CDAC_REF_AUTO_EN))
#define CY_CAPSENSE_CSD_CDAC_FINE_USAGE             ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN) &&\
                                                     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CDAC_FINE_EN))

#define CY_CAPSENSE_CSX_CDAC_COMP_USAGE             ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN) &&\
                                                     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CDAC_COMP_EN))
#define CY_CAPSENSE_CSX_CDAC_COMP_AUTO_USAGE        ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN) &&\
                                                     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CALIBRATION_EN) &&\
                                                     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CDAC_COMP_EN))
#define CY_CAPSENSE_CSX_CDAC_COMP_DIV_AUTO_USAGE    ((CY_CAPSENSE_CSX_CDAC_COMP_USAGE) &&\
                                                     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CALIBRATION_EN) &&\
                                                     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CDAC_COMP_DIV_AUTO_EN))
#define CY_CAPSENSE_CSX_CDAC_CALIBRATION_USAGE      ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN) &&\
                                                     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CALIBRATION_EN))
#define CY_CAPSENSE_CSX_CDAC_REF_AUTO_USAGE         ((CY_CAPSENSE_CSX_CDAC_CALIBRATION_USAGE) &&\
                                                     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CDAC_REF_AUTO_EN))
#define CY_CAPSENSE_CSX_CDAC_FINE_USAGE             ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN) &&\
                                                     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CDAC_FINE_EN))

#define CY_CAPSENSE_ISX_CDAC_COMP_USAGE             ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_EN) &&\
                                                     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_CDAC_COMP_EN))
#define CY_CAPSENSE_ISX_CDAC_COMP_AUTO_USAGE        ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_EN) &&\
                                                     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_CALIBRATION_EN) &&\
                                                     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_CDAC_COMP_EN))
#define CY_CAPSENSE_ISX_CDAC_COMP_DIV_AUTO_USAGE    ((CY_CAPSENSE_ISX_CDAC_COMP_USAGE) &&\
                                                     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_CALIBRATION_EN) &&\
                                                     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_CDAC_COMP_DIV_AUTO_EN))
#define CY_CAPSENSE_ISX_CDAC_CALIBRATION_USAGE      ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_EN) &&\
                                                     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_CALIBRATION_EN))
#define CY_CAPSENSE_ISX_CDAC_REF_AUTO_USAGE         ((CY_CAPSENSE_ISX_CDAC_CALIBRATION_USAGE) &&\
                                                     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_CDAC_REF_AUTO_EN))
#define CY_CAPSENSE_ISX_CDAC_FINE_USAGE             ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_EN) &&\
                                                     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_CDAC_FINE_EN))

#define CY_CAPSENSE_WBX_CDAC_COMP_USAGE             ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_EN) &&\
                                                     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_CDAC_COMP_EN))
#define CY_CAPSENSE_WBX_CDAC_COMP_AUTO_USAGE        ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_EN) &&\
                                                     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_CALIBRATION_EN) &&\
                                                     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_CDAC_COMP_EN))
#define CY_CAPSENSE_WBX_CDAC_COMP_DIV_AUTO_USAGE    ((CY_CAPSENSE_WBX_CDAC_COMP_USAGE) &&\
                                                     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_CALIBRATION_EN) &&\
                                                     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_CDAC_COMP_DIV_AUTO_EN))
#define CY_CAPSENSE_WBX_CDAC_CALIBRATION_USAGE      ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_EN) &&\
                                                     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_CALIBRATION_EN))
#define CY_CAPSENSE_WBX_CDAC_REF_AUTO_USAGE         ((CY_CAPSENSE_WBX_CDAC_CALIBRATION_USAGE) &&\
                                                     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_CDAC_REF_AUTO_EN))
#define CY_CAPSENSE_WBX_CDAC_FINE_USAGE             ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_EN) &&\
                                                     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_CDAC_FINE_EN))

#define CY_CAPSENSE_CDAC_COMP_USAGE                 ((CY_CAPSENSE_CSD_CDAC_COMP_USAGE) ||\
                                                     (CY_CAPSENSE_CSX_CDAC_COMP_USAGE) ||\
                                                     (CY_CAPSENSE_ISX_CDAC_COMP_USAGE))
#define CY_CAPSENSE_CDAC_COMP_AUTO_USAGE            ((CY_CAPSENSE_CSD_CDAC_COMP_AUTO_USAGE) ||\
                                                     (CY_CAPSENSE_CSX_CDAC_COMP_AUTO_USAGE) ||\
                                                     (CY_CAPSENSE_ISX_CDAC_COMP_AUTO_USAGE))
#define CY_CAPSENSE_CDAC_COMP_DIV_AUTO_USAGE        ((CY_CAPSENSE_CSD_CDAC_COMP_DIV_AUTO_USAGE) ||\
                                                     (CY_CAPSENSE_CSX_CDAC_COMP_DIV_AUTO_USAGE) ||\
                                                     (CY_CAPSENSE_ISX_CDAC_COMP_DIV_AUTO_USAGE))
#define CY_CAPSENSE_CDAC_REF_AUTO_USAGE             ((CY_CAPSENSE_CSD_CDAC_REF_AUTO_USAGE) ||\
                                                     (CY_CAPSENSE_CSX_CDAC_REF_AUTO_USAGE) ||\
                                                     (CY_CAPSENSE_ISX_CDAC_REF_AUTO_USAGE))
#define CY_CAPSENSE_CDAC_FINE_USAGE                 ((CY_CAPSENSE_CSD_CDAC_FINE_USAGE) ||\
                                                     (CY_CAPSENSE_CSX_CDAC_FINE_USAGE) ||\
                                                     (CY_CAPSENSE_ISX_CDAC_FINE_USAGE) ||\
                                                     (CY_CAPSENSE_WBX_CDAC_FINE_USAGE))

#define CY_CAPSENSE_CALIBRATION_EN_POS               (0u)
#define CY_CAPSENSE_CDAC_COMP_USAGE_POS              (1u)
#define CY_CAPSENSE_CDAC_COMP_DIV_AUTO_USAGE_POS     (2u)
#define CY_CAPSENSE_CDAC_REF_AUTO_USAGE_POS          (3u)
#define CY_CAPSENSE_CDAC_CDAC_FINE_USAGE_POS         (4u)

#define CY_CAPSENSE_CALIBRATION_EN_MSK               (CY_CAPSENSE_ENABLE << CY_CAPSENSE_CALIBRATION_EN_POS)
#define CY_CAPSENSE_CDAC_COMP_USAGE_MSK              (CY_CAPSENSE_ENABLE << CY_CAPSENSE_CDAC_COMP_USAGE_POS)
#define CY_CAPSENSE_CDAC_COMP_DIV_AUTO_USAGE_MSK     (CY_CAPSENSE_ENABLE << CY_CAPSENSE_CDAC_COMP_DIV_AUTO_USAGE_POS)
#define CY_CAPSENSE_CDAC_REF_AUTO_USAGE_MSK          (CY_CAPSENSE_ENABLE << CY_CAPSENSE_CDAC_REF_AUTO_USAGE_POS)
#define CY_CAPSENSE_CDAC_CDAC_FINE_USAGE_MSK         (CY_CAPSENSE_ENABLE << CY_CAPSENSE_CDAC_CDAC_FINE_USAGE_POS)

#define CY_CAPSENSE_CDAC_REF_MODE_MASK               (0x3u)
#define CY_CAPSENSE_CDAC_REF_MODE_POS                (0u)
#define CY_CAPSENSE_CDAC_FINE_MODE_MASK              (0xCu)
#define CY_CAPSENSE_CDAC_FINE_MODE_POS               (2u)
#define CY_CAPSENSE_CDAC_COMP_MODE_MASK              (0x30u)
#define CY_CAPSENSE_CDAC_COMP_MODE_POS               (4u)
#define CY_CAPSENSE_CDAC_COMP_DIV_MODE_MASK          (0xC0u)
#define CY_CAPSENSE_CDAC_COMP_DIV_MODE_POS           (6u)
#define CY_CAPSENSE_CDAC_BOOST_VAL_MASK              (0x700u)
#define CY_CAPSENSE_CDAC_BOOST_VAL_POS               (8u)

#define CY_CAPSENSE_CDAC_MODE_DISABLED               (0x0u)
#define CY_CAPSENSE_CDAC_MODE_MANUAL                 (0x1u)
#define CY_CAPSENSE_CDAC_MODE_AUTO                   (0x2u)

#define CY_CAPSENSE_CDAC_REF_MODE_MANUAL_MASK        (CY_CAPSENSE_CDAC_MODE_MANUAL << CY_CAPSENSE_CDAC_REF_MODE_POS)
#define CY_CAPSENSE_CDAC_REF_MODE_AUTO_MASK          (CY_CAPSENSE_CDAC_MODE_AUTO << CY_CAPSENSE_CDAC_REF_MODE_POS)
#define CY_CAPSENSE_CDAC_FINE_MODE_MANUAL_MASK       (CY_CAPSENSE_CDAC_MODE_MANUAL << CY_CAPSENSE_CDAC_FINE_MODE_POS)
#define CY_CAPSENSE_CDAC_FINE_MODE_AUTO_MASK         (CY_CAPSENSE_CDAC_MODE_AUTO << CY_CAPSENSE_CDAC_FINE_MODE_POS)
#define CY_CAPSENSE_CDAC_COMP_MODE_MANUAL_MASK       (CY_CAPSENSE_CDAC_MODE_MANUAL << CY_CAPSENSE_CDAC_COMP_MODE_POS)
#define CY_CAPSENSE_CDAC_COMP_MODE_AUTO_MASK         (CY_CAPSENSE_CDAC_MODE_AUTO << CY_CAPSENSE_CDAC_COMP_MODE_POS)
#define CY_CAPSENSE_CDAC_COMP_DIV_MODE_AUTO_MASK     (CY_CAPSENSE_CDAC_MODE_AUTO << CY_CAPSENSE_CDAC_COMP_DIV_MODE_POS)

#if CY_CAPSENSE_CSD_CDAC_CALIBRATION_USAGE
    #define CY_CAPSENSE_CSD_CDAC_CALIBRATION_USAGE_EN (CY_CAPSENSE_ENABLE)
#else
    #define CY_CAPSENSE_CSD_CDAC_CALIBRATION_USAGE_EN (CY_CAPSENSE_DISABLE)
#endif

