zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_lp.h
#if CY_CAPSENSE_CSD_CDAC_COMP_USAGE
    #define CY_CAPSENSE_CSD_CDAC_COMP_USAGE_EN (CY_CAPSENSE_ENABLE)
#else
    #define CY_CAPSENSE_CSD_CDAC_COMP_USAGE_EN (CY_CAPSENSE_DISABLE)
#endif

#if CY_CAPSENSE_CSD_CDAC_COMP_DIV_AUTO_USAGE
    #define CY_CAPSENSE_CSD_CDAC_COMP_DIV_AUTO_USAGE_EN (CY_CAPSENSE_ENABLE)
#else
    #define CY_CAPSENSE_CSD_CDAC_COMP_DIV_AUTO_USAGE_EN (CY_CAPSENSE_DISABLE)
#endif

#if CY_CAPSENSE_CSD_CDAC_REF_AUTO_USAGE
    #define CY_CAPSENSE_CSD_CDAC_REF_AUTO_USAGE_EN (CY_CAPSENSE_ENABLE)
#else
    #define CY_CAPSENSE_CSD_CDAC_REF_AUTO_USAGE_EN (CY_CAPSENSE_DISABLE)
#endif

#if CY_CAPSENSE_CSD_CDAC_FINE_USAGE
    #define CY_CAPSENSE_CSD_CDAC_FINE_USAGE_EN (CY_CAPSENSE_ENABLE)
#else
    #define CY_CAPSENSE_CSD_CDAC_FINE_USAGE_EN (CY_CAPSENSE_DISABLE)
#endif

#define CY_CAPSENSE_CSD_CALIBRATION_EN_MSK           (CY_CAPSENSE_CSD_CDAC_CALIBRATION_USAGE_EN    << CY_CAPSENSE_CALIBRATION_EN_POS)
#define CY_CAPSENSE_CSD_CDAC_COMP_USAGE_MSK          (CY_CAPSENSE_CSD_CDAC_COMP_USAGE_EN           << CY_CAPSENSE_CDAC_COMP_USAGE_POS)
#define CY_CAPSENSE_CSD_CDAC_COMP_DIV_AUTO_USAGE_MSK (CY_CAPSENSE_CSD_CDAC_COMP_DIV_AUTO_USAGE_EN  << CY_CAPSENSE_CDAC_COMP_DIV_AUTO_USAGE_POS)
#define CY_CAPSENSE_CSD_CDAC_REF_AUTO_USAGE_MSK      (CY_CAPSENSE_CSD_CDAC_REF_AUTO_USAGE_EN       << CY_CAPSENSE_CDAC_REF_AUTO_USAGE_POS)
#define CY_CAPSENSE_CSD_CDAC_CDAC_FINE_USAGE_MSK     (CY_CAPSENSE_CSD_CDAC_FINE_USAGE_EN           << CY_CAPSENSE_CDAC_CDAC_FINE_USAGE_POS)

#define CY_CAPSENSE_CSD_CALIBRATION_MODE_MSK         ((CY_CAPSENSE_CSD_CALIBRATION_EN_MSK)           |\
                                                      (CY_CAPSENSE_CSD_CDAC_COMP_USAGE_MSK)          |\
                                                      (CY_CAPSENSE_CSD_CDAC_COMP_DIV_AUTO_USAGE_MSK) |\
                                                      (CY_CAPSENSE_CSD_CDAC_REF_AUTO_USAGE_MSK)      |\
                                                      (CY_CAPSENSE_CSD_CDAC_CDAC_FINE_USAGE_MSK))

#if CY_CAPSENSE_CSX_CDAC_CALIBRATION_USAGE
    #define CY_CAPSENSE_CSX_CDAC_CALIBRATION_USAGE_EN (CY_CAPSENSE_ENABLE)
#else
    #define CY_CAPSENSE_CSX_CDAC_CALIBRATION_USAGE_EN (CY_CAPSENSE_DISABLE)
#endif

#if CY_CAPSENSE_CSX_CDAC_COMP_USAGE
    #define CY_CAPSENSE_CSX_CDAC_COMP_USAGE_EN (CY_CAPSENSE_ENABLE)
#else
    #define CY_CAPSENSE_CSX_CDAC_COMP_USAGE_EN (CY_CAPSENSE_DISABLE)
#endif

#if CY_CAPSENSE_CSX_CDAC_COMP_DIV_AUTO_USAGE
    #define CY_CAPSENSE_CSX_CDAC_COMP_DIV_AUTO_USAGE_EN (CY_CAPSENSE_ENABLE)
#else
    #define CY_CAPSENSE_CSX_CDAC_COMP_DIV_AUTO_USAGE_EN (CY_CAPSENSE_DISABLE)
#endif

#if CY_CAPSENSE_CSX_CDAC_REF_AUTO_USAGE
    #define CY_CAPSENSE_CSX_CDAC_REF_AUTO_USAGE_EN (CY_CAPSENSE_ENABLE)
#else
    #define CY_CAPSENSE_CSX_CDAC_REF_AUTO_USAGE_EN (CY_CAPSENSE_DISABLE)
#endif

#if CY_CAPSENSE_CSX_CDAC_FINE_USAGE
    #define CY_CAPSENSE_CSX_CDAC_FINE_USAGE_EN (CY_CAPSENSE_ENABLE)
#else
    #define CY_CAPSENSE_CSX_CDAC_FINE_USAGE_EN (CY_CAPSENSE_DISABLE)
#endif

#define CY_CAPSENSE_CSX_CALIBRATION_EN_MSK           (CY_CAPSENSE_CSX_CDAC_CALIBRATION_USAGE_EN    << CY_CAPSENSE_CALIBRATION_EN_POS)
#define CY_CAPSENSE_CSX_CDAC_COMP_USAGE_MSK          (CY_CAPSENSE_CSX_CDAC_COMP_USAGE_EN           << CY_CAPSENSE_CDAC_COMP_USAGE_POS)
#define CY_CAPSENSE_CSX_CDAC_COMP_DIV_AUTO_USAGE_MSK (CY_CAPSENSE_CSX_CDAC_COMP_DIV_AUTO_USAGE_EN  << CY_CAPSENSE_CDAC_COMP_DIV_AUTO_USAGE_POS)
#define CY_CAPSENSE_CSX_CDAC_REF_AUTO_USAGE_MSK      (CY_CAPSENSE_CSX_CDAC_REF_AUTO_USAGE_EN       << CY_CAPSENSE_CDAC_REF_AUTO_USAGE_POS)
#define CY_CAPSENSE_CSX_CDAC_CDAC_FINE_USAGE_MSK     (CY_CAPSENSE_CSX_CDAC_FINE_USAGE_EN           << CY_CAPSENSE_CDAC_CDAC_FINE_USAGE_POS)

#define CY_CAPSENSE_CSX_CALIBRATION_MODE_MSK          ((CY_CAPSENSE_CSX_CALIBRATION_EN_MSK)           |\
                                                       (CY_CAPSENSE_CSX_CDAC_COMP_USAGE_MSK)          |\
                                                       (CY_CAPSENSE_CSX_CDAC_COMP_DIV_AUTO_USAGE_MSK) |\
                                                       (CY_CAPSENSE_CSX_CDAC_REF_AUTO_USAGE_MSK)      |\
                                                       (CY_CAPSENSE_CSX_CDAC_CDAC_FINE_USAGE_MSK))

#if CY_CAPSENSE_ISX_CDAC_CALIBRATION_USAGE
    #define CY_CAPSENSE_ISX_CDAC_CALIBRATION_USAGE_EN (CY_CAPSENSE_ENABLE)
#else
    #define CY_CAPSENSE_ISX_CDAC_CALIBRATION_USAGE_EN (CY_CAPSENSE_DISABLE)
#endif

#if CY_CAPSENSE_ISX_CDAC_COMP_USAGE
    #define CY_CAPSENSE_ISX_CDAC_COMP_USAGE_EN (CY_CAPSENSE_ENABLE)
#else
    #define CY_CAPSENSE_ISX_CDAC_COMP_USAGE_EN (CY_CAPSENSE_DISABLE)
#endif

#if CY_CAPSENSE_ISX_CDAC_COMP_DIV_AUTO_USAGE
    #define CY_CAPSENSE_ISX_CDAC_COMP_DIV_AUTO_USAGE_EN (CY_CAPSENSE_ENABLE)
#else
    #define CY_CAPSENSE_ISX_CDAC_COMP_DIV_AUTO_USAGE_EN (CY_CAPSENSE_DISABLE)
#endif

#if CY_CAPSENSE_ISX_CDAC_REF_AUTO_USAGE
    #define CY_CAPSENSE_ISX_CDAC_REF_AUTO_USAGE_EN (CY_CAPSENSE_ENABLE)
#else
    #define CY_CAPSENSE_ISX_CDAC_REF_AUTO_USAGE_EN (CY_CAPSENSE_DISABLE)
#endif

#if CY_CAPSENSE_ISX_CDAC_FINE_USAGE
    #define CY_CAPSENSE_ISX_CDAC_FINE_USAGE_EN (CY_CAPSENSE_ENABLE)
#else
    #define CY_CAPSENSE_ISX_CDAC_FINE_USAGE_EN (CY_CAPSENSE_DISABLE)
#endif

#define CY_CAPSENSE_ISX_CALIBRATION_EN_MSK           (CY_CAPSENSE_ISX_CDAC_CALIBRATION_USAGE_EN    << CY_CAPSENSE_CALIBRATION_EN_POS)
#define CY_CAPSENSE_ISX_CDAC_COMP_USAGE_MSK          (CY_CAPSENSE_ISX_CDAC_COMP_USAGE_EN           << CY_CAPSENSE_CDAC_COMP_USAGE_POS)
#define CY_CAPSENSE_ISX_CDAC_COMP_DIV_AUTO_USAGE_MSK (CY_CAPSENSE_ISX_CDAC_COMP_DIV_AUTO_USAGE_EN  << CY_CAPSENSE_CDAC_COMP_DIV_AUTO_USAGE_POS)
#define CY_CAPSENSE_ISX_CDAC_REF_AUTO_USAGE_MSK      (CY_CAPSENSE_ISX_CDAC_REF_AUTO_USAGE_EN       << CY_CAPSENSE_CDAC_REF_AUTO_USAGE_POS)
#define CY_CAPSENSE_ISX_CDAC_CDAC_FINE_USAGE_MSK     (CY_CAPSENSE_ISX_CDAC_FINE_USAGE_EN           << CY_CAPSENSE_CDAC_CDAC_FINE_USAGE_POS)

#define CY_CAPSENSE_ISX_CALIBRATION_MODE_MSK          ((CY_CAPSENSE_ISX_CALIBRATION_EN_MSK)           |\
                                                       (CY_CAPSENSE_ISX_CDAC_COMP_USAGE_MSK)          |\
                                                       (CY_CAPSENSE_ISX_CDAC_COMP_DIV_AUTO_USAGE_MSK) |\
                                                       (CY_CAPSENSE_ISX_CDAC_REF_AUTO_USAGE_MSK)      |\
                                                       (CY_CAPSENSE_ISX_CDAC_CDAC_FINE_USAGE_MSK))

#define CY_CAPSENSE_CPU_CLK_MHZ                     (CY_CAPSENSE_CPU_CLK / CY_CAPSENSE_CONVERSION_MEGA)

/* Used for the Cy_CapSense_ExecuteSaturatedScan() function to obtain the MAX raw count. */
#define CY_CAPSENSE_SATURATED_MAX_COUNT             (0u)
/* Used for the Cy_CapSense_ExecuteSaturatedScan() function to obtain the scan duration. */
#define CY_CAPSENSE_SATURATED_SCAN_TIME             (1u)


#if defined(__cplusplus)
}
#endif

#endif /* CY_IP_M0S8MSCV3LP */

#endif /* CY_CAPSENSE_SENSING_LP_H */


/* [] END OF FILE */
